content/about.md
+++
title = "About"
author = ["Abhimanyu G"]
description = "About Abhimanyu G - Embedded Linux Engineer, Kernel Developer, ARM Expert"
draft = false
showDate = false
showReadingTime = false
showWordCount = false
+++

I'm a systems engineer and Linux enthusiast passionate about building deeply technical solutions at the intersection of hardware and software. With a strong focus on embedded Linux, kernel development, and ARM architecture, I help companies design performant, low-level systems that scale.

I'm currently diving deep into the Linux kernel and real-time systems, contributing to open-source projects, and sharing what I learn along the way. Whether it's writing drivers, debugging obscure bugs, or optimizing build systems, I love solving hard problems that touch silicon.


## My Experiences {#my-experiences}


### SiMa.ai {#sima-dot-ai}


#### Staff Engineer {#staff-engineer}

{{< badge >}}
Sep'25-current
{{< /badge >}}

Linux BSP and platform developer, responsible for multitude of low level development. Currently working on _video codec_ integration and _network-on-chip_ software development.

`kernel driver`, `C programming language`, `ARM SoC`, `yocto project`


### Samsung Semiconductor India Research {#samsung-semiconductor-india-research}


#### Staff Engineer {#staff-engineer}

{{< badge >}}
Mar'23 - Sep'24
{{< /badge >}}


#### Associate Staff Engineer {#associate-staff-engineer}

{{< badge >}}
Jul'21 - Mar'23
{{< /badge >}}

I was hired at this position into _custom SoC_ team which later merged with **Samsung Automotive team**. There I dived deeper into ARM SoC and its secure offerings


### PathPartner Technologies (Now KPIT) {#pathpartner-technologies--now-kpit}


#### Senior Software Engineer {#senior-software-engineer}

{{< badge >}}
Jul'19 - Jun'21
{{< /badge >}}


#### Software Engineer {#software-engineer}

{{< badge >}}
Feb'18 - Jul'19
{{< /badge >}}


#### Project Trainee {#project-trainee}

{{< badge >}}
Apr'17 - Jan'18
{{< /badge >}}


### V3Novus Private Ltd {#v3novus-private-ltd}


#### Software Engineer {#software-engineer}

{{< badge >}}
Mar'16 - Apr'17
{{< /badge >}}


## Projects {#projects}

TBD
